package com.example.myaepp1.ui.flashcards

val flashcards = listOf(
    Flashcard(
        question = "Ποιες είναι οι διαφορές μεταξύ πινάκων και λιστών;",
        answer = "1. Ο πίνακας θεωρείται μια δομή τυχαίας προσπέλασης, σε αντίθεση με μια λίστα που είναι στην ουσία μια δομή ακολουθιακής ή σειριακής προσπέλασης. Για να φθάσουμε, δηλαδή, σ’ έναν κόμβο μιας λίστας πρέπει να περάσουμε από όλους τους προηγούμενους ξεκινώντας από τον πρώτο. " +
                "2. Ο πίνακας έχει σταθερό μέγεθος, το οποίο δηλώνεται εξαρχής κατά την υλοποίηση. Αυτό γίνεται, διότι ο πίνακας είναι στατική δομή δεδομένων σε αντίθεση με τη λίστα που είναι δυναμική δομή και το μέγεθός της μπορεί να μεταβάλλεται καθώς εισέρχονται νέοι κόμβοι στη λίστα ή διαγράφονται κάποιοι άλλοι. " +
                "3. Oι κόμβοι της λίστας αποθηκεύονται σε μη συνεχόμενες θέσεις μνήμης σε αντιδιαστολή με τους πίνακες, όπου τα στοιχεία αποθηκεύονται σε συνεχόμενες θέσεις μνήμης."
    ),
    Flashcard(
        question = "Να αναφέρετε ονομαστικά τα είδη της εμβέλειας μεταβλητών.",
        answer = "1. Απεριόριστη εμβέλεια " +
                "2. Περιορισμένη εμβέλεια " +
                "3. Μερικώς περιορισμένη εμβέλεια"
    ),
    Flashcard(
        question = "Ποια εμβέλεια μεταβλητών χρησιμοποιείται στη ΓΛΩΣΣΑ;",
        answer = "Στη ΓΛΩΣΣΑ έχουμε περιορισμένη εμβέλεια."
    ),
    Flashcard(
        question = "Να αναφέρετε επιγραμματικά τις τυπικές επεξεργασίες των πινάκων.",
        answer = "1. Υπολογισμός αθροισμάτων στοιχείων του πίνακα. " +
                "2. Εύρεση του μέγιστου ή του ελάχιστου στοιχείου. " +
                "3. Ταξινόμηση των στοιχείων του πίνακα. " +
                "4. Αναζήτηση ενός στοιχείου του πίνακα. " +
                "5. Συγχώνευση δύο πινάκων. \n"
    ),
    Flashcard(
        question = "Τι ονομάζεται γράφος (graph);",
        answer = "Ένας γράφος είναι μία δομή που αποτελείται από ένα σύνολο κόμβων (ή σημείων ή κορυφών) και ένα σύνολο γραμμών (ή ακμών ή τόξων) που ενώνουν μερικούς ή όλους τους κόμβους. Ο γράφος αποτελεί την πιο γενική δομή δεδομένων, με την έννοια ότι όλες οι προηγούμενες δομές που παρουσιάστηκαν μπορούν να θεωρηθούν περιπτώσεις γράφων."
    ),
    Flashcard(
        question = "Να αναφέρετε επιγραμματικά τους τύπους των γράφων.",
        answer = "Κατευθυνόμενος γράφος και μη κατευθυνόμενος γράφος.\n"
    ),
    Flashcard(
        question = "Να αναφέρετε τις βασικές πράξεις των συνδεδεμένων λιστών.\n",
        answer = "Οι βασικές πράξεις των συνδεδεμένων λιστών είναι οι παρακάτω:\n" +
                "• Εισαγωγή κόμβου στη λίστα (εισαγωγή κόμβου στην αρχή, στο τέλος της\n" +
                "λίστας ή ενδιάμεσα).\n" +
                "• Διαγραφή κόμβου από τη λίστα (διαγραφή από την αρχή, το τέλος της\n" +
                "λίστας ή ενδιάμεσα).\n" +
                "• Έλεγχος για το αν η λίστα είναι κενή.\n" +
                "• Αναζήτηση κόμβου για την εύρεση συγκεκριμένου στοιχείου.\n" +
                "• Διάσχιση της λίστας και προσπέλαση των στοιχείων της (π.χ. εκτύπωση\n" +
                "των δεδομένων που περιέχονται σε όλους τους κόμβους της λίστας).\n"
    ),
    Flashcard(
        question = "Να αναφέρετε επιγραμματικά τα κριτήρια που πρέπει να ικανοποιεί ένας\n" +
                "αλγόριθμος.\n",
        answer ="• Είσοδος\n" +
                "• Έξοδος\n" +
                "• Καθοριστικότητα\n" +
                "• Περατότητα\n" +
                "• Αποτελεσματικότητα\n" +
                "\n"
    ),
    Flashcard(
        question = "Τι ονομάζεται δυαδικό δένδρο;",
        answer = "Ένα δυαδικό δένδρο είναι ένα διατεταγμένο δένδρο, στο οποίο κάθε κόμβος έχει το\n" +
                "πολύ δύο παιδιά, το αριστερό και το δεξί παιδί.\n"
    ),
    Flashcard(
        question = "Τι καθορίζουν οι ιδιότητες και τι οι μέθοδοι ενός αντικειμένου;",
        answer = "Τα δεδομένα τα οποία είναι τα χαρακτηριστικά ενός αντικειμένου και αναφέρονται ως ιδιότητες και τις ενέργειες που καθορίζουν τη συμπεριφορά του. Οι ενέργειες στον\n" +
                "αντικειμενοστραφή προγραμματισμό αναφέρονται και ως μέθοδοι.\n"
    ),
    Flashcard(
        question = "Τι ονομάζεται αντικείμενο πρόγραμμα;",
        answer = "Αντικείμενο πρόγραμμα είναι το πρόγραμμα που παράγει ο μεταγλωττιστής, και είναι\n" +
                "γραμμένο σε γλώσσα μηχανής.\n"
    ),
    Flashcard(
        question = "Να δώσετε τον ορισμό της διαδικασίας και τον ορισμό της\n" +
                "συνάρτησης.\n" +
                "\n",
        answer = "Διαδικασία είναι εκείνος ο τύπος υποπρογράμματος που εκτελεί όλες τις λειτουργίες ενός\n" +
                "προγράμματος.\n" +
                "Συνάρτηση είναι εκείνος ο τύπος υποπρογράμματος που υπολογίζει και επιστρέφει μία\n" +
                "μόνο τιμή με το όνομά της (όπως οι μαθηματικές συναρτήσεις).\n"
    ),
    Flashcard(
        question = "Να αναφέρετε τους κανόνες που πρέπει να ακολουθούν οι λίστες των\n" +
                "παραμέτρων στα υποπρογράμματα.\n",
        answer = "- ίδιος αριθμός πραγματικών και τυπικών παραμέτρων\n" +
                "- κάθε πραγματική αντιστοιχεί στην τυπική παράμετρο στην αντίστοιχη θέση\n" +
                "- τυπική και πραγματική παράμετρος να είναι ίδιου τύπου\n"
    ),
    Flashcard(
        question = "Να αναφέρετε τις μαθηματικές συναρτήσεις που\n" +
                "περιέχονται στη ΓΛΩΣΣΑ.\n",
        answer = " ΗΜ(Χ), ΣΥΝ(Χ), ΕΦ(Χ), Τ_Ρ(Χ), Α_Μ(Χ), Α_Τ(Χ), ΛΟΓ(Χ), Ε(Χ)"
    ),
    Flashcard(
        question = "Τι είναι δομή δεδομένων;",
        answer = "Δομή Δεδομένων είναι ένα σύνολο αποθηκευμένων δεδομένων που υφίστανται\n" +
                "επεξεργασία από ένα σύνολο λειτουργιών.\n"
    ),
    Flashcard(
        question = "Να αναφέρετε ονομαστικά τις λειτουργίες επί των δομών δεδομένων.\n",
        answer = "Προσπέλαση (access), " +
                "Εισαγωγή (insertion), " +
                "Διαγραφή (deletion), " +
                "Αναζήτηση (searching),\n" +
                "Ταξινόμηση (sorting)\n" +
                "Αντιγραφή(copying)\n"+
                "Συγχώνευση(merging)\n" +
                "Διαχωρισμός(seperation)\n"
    ),
    Flashcard(
        question = "Να αναφέρετε ονομαστικά τα στοιχεία που προσδιορίζουν μία\n" +
                "γλώσσα.\n",
        answer = "Μία γλώσσα προσδιορίζεται από το αλφάβητο της, το λεξιλόγιο της, τη γραμματική της\n" +
                "και τέλος τη σημασιολογία της.\n"
    ),
    Flashcard(
        question = "Τι εννοείται με τον όρο «Στατική Δομή Δεδομένων» ;",
        answer = "Με τον όρο στατική δομή δεδομένων εννοείται ότι το ακριβές μέγεθος της\n" +
                "απαιτούμενης κύριας μνήμης καθορίζεται κατά τη στιγμή του προγραμματισμού τους,\n" +
                "και κατά συνέπεια κατά τη στιγμή της μετάφρασής τους και όχι κατά τη στιγμή της\n" +
                "εκτέλεσης του προγράμματος.\n"
    ),
    Flashcard(
        question = "Πώς υλοποιείται στη ΓΛΩΣΣΑ μια στατική δομή δεδομένων; ",
        answer = "Στη ΓΛΩΣΣΑ, οι στατικές δομές υλοποιούνται με\n" +
                "πίνακες που μας είναι γνωστοί από άλλα μαθήματα και υποστηρίζονται από κάθε\n" +
                "γλώσσα προγραμματισμού.\n"
    ),
    Flashcard(
        question = "Τι εννοούμε με τον όρο «τυπικό» και τι με τον όρο «συντακτικό» μιας\n" +
                "γλώσσας;\n",
        answer = "Τυπικό είναι το σύνολο των κανόνων που ορίζει τις μορφές με τις οποίες μία λέξη\n" +
                "είναι αποδεκτή.\n" +
                "Συντακτικό είναι το σύνολο των κανόνων που καθορίζει τη νομιμότητα της διάταξης και\n" +
                "της σύνδεσης των λέξεων της γλώσσας για τη δημιουργία προτάσεων.\n"
    ),
    Flashcard(
        question = "Να περιγράψετε τις βασικές λειτουργίες\n" +
                "επί των δομών δεδομένων που μπορούν να χρησιμοποιηθούν στους\n" +
                "πίνακες.\n",
        answer = "Προσπέλαση (access), πρόσβαση σε ένα κόμβο με σκοπό να εξετασθεί ή να\n" +
                "τροποποιηθεί το περιεχόμενό του.\n" +
                "- Εισαγωγή (insertion), δηλαδή η προσθήκη νέων κόμβων σε μία υπάρχουσα δομή.\n" +
                "- Διαγραφή (deletion), που αποτελεί το αντίστροφο της εισαγωγής, δηλαδή ένας\n" +
                "κόμβος αφαιρείται από μία δομή.\n" +
                "- Αναζήτηση (searching), κατά την οποία προσπελαύνονται οι κόμβοι μιας δομής,\n" +
                "προκειμένου να εντοπιστούν ένας ή περισσότεροι που έχουν μια δεδομένη ιδιότητα.\n" +
                "- Ταξινόμηση (sorting), όπου οι κόμβοι μιας δομής διατάσσονται κατά αύξουσα ή\n" +
                "φθίνουσα σειρά.\n" +
                "- Αντιγραφή (copying), κατά την οποία όλοι οι κόμβοι ή μερικοί από τους κόμβους\n" +
                "μίας δομής αντιγράφονται σε μία άλλη δομή.\n" +
                "- Συγχώνευση (merging), κατά την οποία δύο ή περισσότερες δομές συνενώνονται\n" +
                "σε μία ενιαία δομή.\n" +
                "- Διαχωρισμός (separation), που αποτελεί την αντίστροφη πράξη της συγχώνευσης.\n"
    ),



)

